// Abdulkadir U. - 26/11/2025

/**
 * Client Test (İstemci Test)
 * 
 * Basit bir istemci oluşturup sunucuya mesaj
 * gidip gitmediğini test edeceğiz
 */

// Include:
#include <Platform/Platform.h>
#include <Tool/Utf/Utf.h>
#include <Algorithm/AlgorithmPool.h>
#include <Socket/Socket.h>

#include <iostream>
#include <vector>

// Using Namespace:
using namespace tool;
using namespace core::algorithmpool;

// main
int main(void)
{
    Xor testxor(U"xor-test-key-123");

    int sock = ::socket(AF_INET, SOCK_STREAM, 0);
    if( sock < 0 )
        return perror("socket"), 1;

    sockaddr_in addr {};
    addr.sin_family = AF_INET;
    addr.sin_port = htons(8080);
    addr.sin_addr.s_addr = inet_addr("127.0.0.1");

    if( ::connect(sock, (sockaddr*)&addr, sizeof(addr)) < 0 )
        return perror("connect"), 2;

    std::u32string msg = U"Hello Server 😁, It's Client! 😌";
    // std::u32string msg =U"😑😒😓😔😕abcdef😑😒😓😔😕a😑😒😓😔😕abcdef😑😒😓😔😕a😑😒😓😔😕abcdef😑😒😓😔😕a😑😒😓😔😕abcdef😑😒😓😔😕a 1 😑😒😓😔😕abcdef😑😒😓😔😕a😑😒😓😔😕abcdef😑😒😓😔😕a😑😒😓😔😕abcdef😑😒😓😔😕a😑😒😓😔😕abcdef😑😒😓😔😕a 2 😑😒😓😔😕abcdef😑😒😓😔😕a😑😒😓😔😕abcdef😑😒😓😔😕a😑😒😓😔😕abcdef😑😒😓😔😕a😑😒😓😔😕abcdef😑😒😓😔😕a 3 😑😒😓😔😕abcdef😑😒😓😔😕a😑😒😓😔😕abcdef😑😒😓😔😕a😑😒😓😔😕abcdef😑😒😓😔😕a😑😒😓😔😕abcdef😑😒😓😔😕a 4 😑😒😓😔😕abcdef😑😒😓😔😕a😑😒😓😔😕abcdef😑😒😓😔😕a😑😒😓😔😕abcdef😑😒😓😔😕a😑😒😓😔😕abcdef😑😒😓😔😕a 5 😑😒😓😔😕abcdef😑😒😓😔😕a😑😒😓😔😕abcdef😑😒😓😔😕a😑😒😓😔😕abcdef😑😒😓😔😕a😑😒😓😔😕abcdef😑😒😓😔😕a 6 😑😒😓😔😕abcdef😑😒😓😔😕a😑😒😓😔😕abcdef😑😒😓😔😕a😑😒😓😔😕abcdef😑😒😓😔😕a😑😒😓😔😕abcdef😑😒😓😔😕a 7 😑😒😓😔😕abcdef😑😒😓😔😕a😑😒😓😔😕abcdef😑😒😓😔😕a😑😒😓😔😕abcdef😑😒😓😔😕a😑😒😓😔😕abcdef😑😒😓😔😕a 8 😑😒😓😔😕abcdef😑😒😓😔😕a😑😒😓😔😕abcdef😑😒😓😔😕a😑😒😓😔😕abcdef😑😒😓😔😕a😑😒😓😔😕abcdef😑😒😓😔😕a 9 😑😒😓😔😕abcdef😑😒😓😔😕a😑😒😓😔😕abcdef😑😒😓😔😕a😑😒😓😔😕abcdef😑😒😓😔😕a😑😒😓😔😕abcdef😑😒😓😔😕a 10 😑😒😓😔😕abcdef😑😒😓😔😕a😑😒😓😔😕abcdef😑😒😓😔😕a😑😒😓😔😕abcdef😑😒😓😔😕a😑😒😓😔😕abcdef😑😒😓😔😕a 11 😑😒😓😔😕abcdef😑😒😓😔😕a😑😒😓😔😕abcdef😑😒😓😔😕a😑😒😓😔😕abcdef😑😒😓😔😕a😑😒😓😔😕abcdef😑😒😓😔😕a 12 😑😒😓😔😕abcdef😑😒😓😔😕a😑😒😓😔😕abcdef😑😒😓😔😕a😑😒😓😔😕abcdef😑😒😓😔😕a😑😒😓😔😕abcdef😑😒😓😔😕a 13 😑😒😓😔😕abcdef😑😒😓😔😕a😑😒😓😔😕abcdef😑😒😓😔😕a😑😒😓😔😕abcdef😑😒😓😔😕a😑😒😓😔😕abcdef😑😒😓😔😕a 14 😑😒😓😔😕abcdef😑😒😓😔😕a😑😒😓😔😕abcdef😑😒😓😔😕a😑😒😓😔😕abcdef😑😒😓😔😕a😑😒😓😔😕abcdef😑😒😓😔😕a 15 😑😒😓😔😕abcdef😑😒😓😔😕a😑😒😓😔😕abcdef😑😒😓😔😕a😑😒😓😔😕abcdef😑😒😓😔😕a😑😒😓😔😕abcdef😑😒😓😔😕a 16 😑😒😓😔😕abcdef😑😒😓😔😕a😑😒😓😔😕abcdef😑😒😓😔😕a😑😒😓😔😕abcdef😑😒😓😔😕a😑😒😓😔😕abcdef😑😒😓😔😕a 17 😑😒😓😔😕abcdef😑😒😓😔😕a😑😒😓😔😕abcdef😑😒😓😔😕a😑😒😓😔😕abcdef😑😒😓😔😕a😑😒😓😔😕abcdef😑😒😓😔😕a 18 😑😒😓😔😕abcdef😑😒😓😔😕a😑😒😓😔😕abcdef😑😒😓😔😕a😑😒😓😔😕abcdef😑😒😓😔😕a😑😒😓😔😕abcdef😑😒😓😔😕a 19 😑😒😓😔😕abcdef😑😒😓😔😕a😑😒😓😔😕abcdef😑😒😓😔😕a😑😒😓😔😕abcdef😑😒😓😔😕a😑😒😓😔😕abcdef😑😒😓😔😕a 20";
    testxor.encrypt(msg);

    ::send(sock, msg.data(), msg.size() * sizeof(char32_t), 0);

    std::vector<char32_t> buffer(1024);

    int r = ::recv(sock, buffer.data(), buffer.size() * sizeof(char32_t), 0);
    if( r <= 0 )
        return perror("recv"), close(sock), 3;

    buffer.resize(r / sizeof(char32_t));
    
    std::u32string reply(buffer.begin(), buffer.end());
    testxor.decrypt(reply);

    std::cout << tool::utf::to_utf8(reply) << std::endl;
    ::close(sock);
}